tutorial/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chemFoam_mesh;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.03;

deltaT          1e-7;

writeControl    adjustableRunTime;

writeInterval   0.001;

writeFormat     binary;

writePrecision  10;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxDeltaT	1e-4;
DebugSwitches
{
    SolverPerformance   0;
}

// ************************************************************************* //
