tutorial/system/funkySetBoundaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetBoundaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

velocities
{
    field U;
    expressions
    (
        {
            target value;
            patchName inlet;
            variables
            (
                "Umax=1.0;"
                "xCoord=pos().x;"
                "xCoordMax=max(xCoord);"
            );
            expression "(1-pow(xCoord/xCoordMax,2)) * Umax * vector(0,1,0)";
        }
    );
}
// ************************************************************************* //

