tutorial/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      funkySetFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
(

    Uscaled  // sinus perturbation
    {
        field U;
        create false;
        variables
        (
            "Umax=40;"
            "L=0.008;"
            "ro=0.0004;"
            "B=5;"
        );
        expression "U + vector(1,0,0)*Umax*0.5*(1-tanh(B*(mag(pos().y-L/2)/ro - ro/mag(pos().y-L/2)))) + vector(0,1,0)*(Umax/2000)*sin(2*pi*pos().x/(L/2))";
        keepPatches true;
        //dimension [0 0 0 0 0 0 0];
    }

    TSmooth
    {
        field T;
        create false;
        variables
        (
            "A=700;"       
            "L=0.008;"           
            "ro=0.0004;"          
            "B=5;"
        );
        expression "T - ((A-373)*0.5*(1-tanh(B*(mag(pos().y-L/2)/ro - ro/mag(pos().y-L/2)))))";
        keepPatches true;
        dimension [0 0 0 0 0 0 0];
    }


    NDOD
    {
        field C12H26;
        create false;
        variables
        (
            "A=0.5;"       
            "L=0.008;"           
            "ro=0.0004;"          
            "B=5;"
        );
        expression "C12H26 + ((A-0)*0.5*(1-tanh(B*(mag(pos().y-L/2)/ro - ro/mag(pos().y-L/2)))))";
        keepPatches true;
        dimension [0 0 0 0 0 0 0];
    }


    O2smooth
    {
        field O2;
        create false;
        variables
        (
            "A=0.115;"
            "L=0.008;"
            "ro=0.0004;"
            "B=5;"
        );
        expression "O2 -(A*( 0.5*(1-tanh(B*(mag(pos().y-L/2)/ro - ro/mag(pos().y-L/2))))  ))";
        keepPatches true;
        dimension [0 0 0 0 0 0 0];
    }

    N2smooth
    {
        field N2;
        create false;
        variables
        (
            "A=0.385;"
            "L=0.008;"
            "ro=0.0004;"
            "B=5;"
        );
        expression "N2 -(A*( 0.5*(1-tanh(B*(mag(pos().y-L/2)/ro - ro/mag(pos().y-L/2))))  ))";
        keepPatches true;
        dimension [0 0 0 0 0 0 0];
    }

);




// ************************************************************************* //

